#define TIMELIB_EXPORTS

#include "TimeLibHeader.h"
#include <map>

map<int, string> Hours = {
	{0, "ноль"}, {1, "один"}, {2, "два"}, {3, "три"}, {4, "четыре"}, {5, "пять"}, {6, "шесть"},
	{7, "семь"}, {8, "восемь"}, {9, "девять"}, {10, "десять"}, {11, "одиннадцать"}, {12, "двенадцать"},
	{13, "тринадцать"}, {14, "четырнадцать"}, {15, "пятнадцать"}, {16, "шестнадцать"}, {17, "семнадцать"},
	{18, "восемнадцать"}, {19, "девятнадцать"}, {20, "двадцать"}, {21, "двадцать один"}, {22, "двадцать два"}, {23, "двадцать три"}
};

map<int, string> Minutes = {
	{0, "ноль"}, {1, "одна"}, {2, "две"}, {3, "три"}, {4, "четыре"}, {5, "пять"}, {6, "шесть"},
	{7, "семь"}, {8, "восемь"}, {9, "девять"}, {10, "десять"}, {11, "одиннадцать"}, {12, "двенадцать"},
	{13, "тринадцать"}, {14, "четырнадцать"}, {15, "пятнадцать"}, {16, "шестнадцать"}, {17, "семнадцать"}, {18, "восемнадцать"},
	{19, "девятнадцать"}, {20, "двадцать"}, {21, "двадцать одна"}, {22, "двадцать две"}, {23, "двадцать три"}, {24, "двадцать четыре"},
	{25, "двадцать пять"}, {26, "двадцать шесть"}, {27, "двадцать семь"}, {28, "двадцать восемь"}, {29, "двадцать девять"}, {30, "тридцать"},
	{31, "тридцать одна"}, {32, "тридцать две"}, {33, "тридцать три"}, {34, "тридцать четыре"}, {35, "тридцать пять"}, {36, "тридцать шесть"},
	{37, "тридцать семь"}, {38, "тридцать восемь"}, {39, "тридцать девять"}, {40, "сорок"}, {41, "сорок одна"}, {42, "сорок две"},
	{43, "сорок три"}, {44, "сорок четыре"}, {45, "сорок пять"}, {46, "сорок шесть"}, {47, "сорок семь"}, {48, "сорок восемь"},
	{49, "сорок девять"}, {50, "пятьдесят"}, {51, "пятьдесят одна"}, {52, "пятьдесят две"}, {53, "пятьдесят три"}, {54, "пятьдесят четыре"},
	{55, "пятьдесят пять"}, {56, "пятьдесят шесть"}, {57, "пятьдесят семь"}, {58, "пятьдесят восемь"}, {59, "пятьдесят девять"}
};

string GetEnding(int remnant, bool whatToDo)
{
	string ending = "";

	if (remnant == 0 || remnant > 4)
	{
		if (whatToDo)
			ending = "часов";
		else
			ending = "минут";
	}
	else if (remnant == 1)
	{
		if (whatToDo)
			ending = "час";
		else
			ending = "минута";
	}
	else if (remnant > 1 && remnant < 5)
	{
		if (whatToDo)
			ending = "часа";
		else
			ending = "минуты";
	}

	return ending;
}

/// <summary>
/// Прибавляет к указанному времени 5 минут.
/// </summary>
/// <param name="time">Исходное время в формате ЧЧ:ММ.</param>
/// <param name="res">Время с прибавленными 5 минутами.</param>
/// <returns>Код результата: 0 - успех, 1 - неверный формат исходного времени, 2 - неверный час, 3 - неверная минута.</returns>
int GetTimePlus5MinStr(string time, string& res)
{
	if (time.length() != 5 || time[2] != ':')
		return 1;

	int hour, minute;

	string hours = "";
	hours += time[0];
	hours += time[1];

	try
	{
		hour = stoi(hours);
	}
	catch(exception)
	{
		return 1;
	}

	if (hour > 23 || hour < 0)
		return 2;

	string minutes = "";
	minutes += time[3];
	minutes += time[4];

	try
	{
		minute = stoi(minutes);
	}
	catch (exception)
	{
		return 1;
	}
	
	if (minute > 59 || minute < 0)
		return 3;

	minute += 5;
	if (minute > 59)
	{
		hour += 1;
		minute -= 60;

		if (hour > 23)
		{
			hour = 0;
		}
	}

	string hourEnding = "";
	int hourRemnant = hour % 10;
	hourEnding = GetEnding(hourRemnant, true);

	string minuteEnding = "";
	int minuteRemnant = minute % 10;
	minuteEnding = GetEnding(minuteRemnant, false);

	res = Hours[hour] + " " + hourEnding + " " + Minutes[minute] + " " + minuteEnding;
	return 0;
}

